<?php
	$pricelist['Ванная']['Личная гигиена']['Зубная щётка'] = 20;
	$pricelist['Ванная']['Личная гигиена']['Зубная паста'] = 57;
	$pricelist['Ванная']['Личная гигиена']['Мыло (детское)'] = 30;
	$pricelist['Ванная']['Личная гигиена']['Мыло (банное)'] = 25;
	$pricelist['Ванная']['Уборка']['Вантуз'] = 200;
	$pricelist['Ванная']['Уборка']['Стиральный порошок'] = 350;
	$pricelist['Ванная']['Уборка']['Стиральные капсулы'] = 410;
	$pricelist['Продукты']['Фрукты']['Яблоко'] = 15;
	$pricelist['Продукты']['Фрукты']['Банан'] = 30;
	$pricelist['Продукты']['Фрукты']['Груша'] = 27;
	$pricelist['Продукты']['Овощи']['Томат'] = 15;
	$pricelist['Продукты']['Овощи']['Морковь'] = 30;
	$pricelist['Продукты']['Овощи']['Картофель'] = 27;
	$pricelist['Продукты']['Полуфабрикаты']['Пельмени'] = 149;
	$pricelist['Продукты']['Полуфабрикаты']['Котлеты'] = 100;
	$pricelist['Продукты']['Полуфабрикаты']['Бизнес-ланч'] = 300;
	$pricelist['Продукты']['Выпечка']['Пирог'] = 15;
	$pricelist['Продукты']['Выпечка']['Багет'] = 30;
	$pricelist['Продукты']['Выпечка']['Хлеб'] = 27;
	$pricelist['Алкогольная продукция']['Крепкиий алкоголь']['Виски'] = 900;
	$pricelist['Алкогольная продукция']['Крепкиий алкоголь']['Водка'] = 800;
	$pricelist['Алкогольная продукция']['Крепкиий алкоголь']['Коньяк'] = 1400;
	$pricelist['Алкогольная продукция']['Лёгкий алкоголь']['Пиво'] = 50;
	$pricelist['Алкогольная продукция']['Лёгкий алкоголь']['Шампанское'] = 1000;
	$pricelist['Алкогольная продукция']['Лёгкий алкоголь']['Сидр'] = 70;
	$pricelist['Никотиносодержащая продукция']['Сигареты']['Парламент'] = 140;
	$pricelist['Никотиносодержащая продукция']['Сигареты']['Бонд'] = 170;
	$pricelist['Никотиносодержащая продукция']['Электронные сигареты']['Jull'] = 1400;
	$pricelist['Никотиносодержащая продукция']['Электронные сигареты']['Logic'] = 990;
?>

<html>
	<head>
		<style>
			table, td{
				border: 1px solid black;
			}
		</style>
	</head>
	
	<body>
		<div>
			<table>
				<tr>
					<td>№</td>
					<td>Название</td>
					<td>Цена</td>
				</tr>
				<?php
					foreach ($pricelist as $key => $i)
					{
						echo "<tr><td colspan = 3 align=center><b>$key</b></td></tr>";
						foreach ($i as $key1 => $j)
						{	
							$number = 0;
							echo "<tr><td colspan = 3 align=center>$key1:</td></tr>";
							foreach ($j as $type => $price)
							{
								printf("<tr>
										<td>%s</td>
										<td>%s</td>
										<td>%s</td>
									</tr>", ++$number, $type, $price);
							}
							$number = 0;
						}
					}
				?>
			</table>
		</div>
	</body>
</html>